Homework 1:

Using chinook.db write pandas code.

Customer Purchases Analysis:
    -Find the total amount spent by each customer on purchases (considering invoices).
    -Identify the top 5 customers with the highest total purchase amounts.
    -Display the customer ID, name, and the total amount spent for the top 5 customers.

In [43]:
import sqlite3 
import pandas as pd

In [44]:
import sqlite3
import pandas as pd

db_path = "C:\python\chinook.db" 
conn = sqlite3.connect(db_path)

query = "SELECT name FROM sqlite_master WHERE type='table';"
tables = pd.read_sql(query, conn)

dfs = {}
for table in tables["name"]:
    dfs[table] = pd.read_sql(f"SELECT * FROM {table}", conn)

conn.close()

In [45]:
globals().update(dfs)

In [21]:
#Find the total amount spent by each customer on purchases (considering invoices).

df1=invoices.groupby('CustomerId').agg({'Total': 'sum'})
df1=pd.merge(df1, customers, on='CustomerId', how='inner')
df1=df1[['CustomerId', 'FirstName', 'LastName', 'Total']]

In [37]:
#Identify the top 5 customers with the highest total purchase amounts.

df1[['FirstName', 'LastName','Total']].sort_values(by='Total', ascending=False).head(5)

   FirstName    LastName  Total
5     Helena        Holý  49.62
25   Richard  Cunningham  47.62
56      Luis       Rojas  46.62
44  Ladislav      Kovács  45.62
45      Hugh    O'Reilly  45.62

In [35]:

#Display the customer ID, name, and the total amount spent for the top 5 customers.

df1[['CustomerId', 'FirstName', 'LastName', 'Total']].sort_values(by='Total', ascending=False).head(5)

    CustomerId FirstName    LastName  Total
5            6    Helena        Holý  49.62
25          26   Richard  Cunningham  47.62
56          57      Luis       Rojas  46.62
44          45  Ladislav      Kovács  45.62
45          46      Hugh    O'Reilly  45.62

2. Album vs. Individual Track Purchases:
    -Determine the percentage of customers who prefer to buy individual tracks instead of full albums.
    -A customer is considered to prefer individual tracks if they have purchased only a subset of tracks from an album.
    -Provide a summary of the percentage of customers who fall into each category (individual tracks vs. full albums).

In [ ]:
#Determine the percentage of customers who prefer to buy individual tracks instead of full albums.

Customers preferring individual tracks: 0.00%